### Essential Functionality

This section will walk you through the fundamental mechanics of interacting with the data contained in a series and dataframe

#### Reindexing

reindex -- which means to create a new object with the values rearranged to align with the new index

In [1]:
import pandas as pd

In [2]:
obj = pd.Series([4.5,7.2,-5.3,3.6],index = ['d','b','a','c'])

In [3]:
obj

d    4.5
b    7.2
a   -5.3
c    3.6
dtype: float64

In [4]:
obj2 = obj.reindex(['a','b','c','d','e'])

In [5]:
obj2

a   -5.3
b    7.2
c    3.6
d    4.5
e    NaN
dtype: float64

method function allows us to do some interploation or filling of values when reindexing 
Using ffill, forward-fills the values

In [6]:
obj3 = pd.Series(['blue','purple','yellow'],index=[0,2,4])

In [7]:
obj3

0      blue
2    purple
4    yellow
dtype: object

In [8]:
obj3.reindex(range(6),method = 'ffill')

0      blue
1      blue
2    purple
3    purple
4    yellow
5    yellow
dtype: object

In [9]:
import numpy as np

In [10]:
# reindex reindexed the rows in the result when passed only the sequence
frame = pd.DataFrame(np.arange(9).reshape((3,3)),index= ['a','c','d'],columns = ['Ohio','Texas','California'])

In [11]:
frame

   Ohio  Texas  California
a     0      1           2
c     3      4           5
d     6      7           8

In [12]:
frame2 = frame.reindex(['a','b','c','d'])

In [13]:
frame2

   Ohio  Texas  California
a   0.0    1.0         2.0
b   NaN    NaN         NaN
c   3.0    4.0         5.0
d   6.0    7.0         8.0

In [14]:
states= ['Texas','Utah','California']

In [15]:
frame.reindex(columns=states)

   Texas  Utah  California
a      1   NaN           2
c      4   NaN           5
d      7   NaN           8

In [16]:
frame

   Ohio  Texas  California
a     0      1           2
c     3      4           5
d     6      7           8

You can also reindex using the loc operator, and many users prefer to it that way. This only works if all of the new index already exist in the dataframe

In [17]:
frame.loc[['a','c','d'],['Texas','California']]

   Texas  California
a      1           2
c      4           5
d      7           8

#### Dropping Entries from an Axis

the drop method will return a new object with the indicated value or values deleted from an axis:

In [18]:
obj = pd.Series(np.arange(5.),index= ['a','b','c','d','e'])

In [19]:
obj

a    0.0
b    1.0
c    2.0
d    3.0
e    4.0
dtype: float64

In [20]:
new_obj = obj.drop('c')

In [21]:
new_obj

a    0.0
b    1.0
d    3.0
e    4.0
dtype: float64

In [22]:
obj.drop(['d','e'])

a    0.0
b    1.0
c    2.0
dtype: float64

In [23]:
obj

a    0.0
b    1.0
c    2.0
d    3.0
e    4.0
dtype: float64

With DataFrame, index values can be deleted from any axis.

In [24]:
data = pd.DataFrame(np.arange(16).reshape((4,4)),index= ['Ohio','Colorado','Utah','New York'],columns=['one','two','three','four'])

In [25]:
data

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [26]:
data.drop(['Colorado','Ohio']) # drop with sequence of labels will drop values from the row labels(axis=0)

          one  two  three  four
Utah        8    9     10    11
New York   12   13     14    15

In [27]:
data.drop('two',axis=1)

          one  three  four
Ohio        0      2     3
Colorado    4      6     7
Utah        8     10    11
New York   12     14    15

In [28]:
data.drop(['two','four'],axis= 'columns')

          one  three
Ohio        0      2
Colorado    4      6
Utah        8     10
New York   12     14

Using the in-place function we can make the changes persist, and not return or make a new obj

In [29]:
obj.drop('c')

a    0.0
b    1.0
d    3.0
e    4.0
dtype: float64

In [30]:
obj

a    0.0
b    1.0
c    2.0
d    3.0
e    4.0
dtype: float64

In [31]:
obj.drop('c',inplace=True)

In [32]:
obj

a    0.0
b    1.0
d    3.0
e    4.0
dtype: float64

#### Indexing, Selection and Filtering

Series indexing(obj[..]) works analogously to Numpy array indexing, except you can use the Series's index values instead of only integers.

In [33]:
obj = pd.Series(np.arange(4.),index= ['a','b','c','d'])

In [34]:
obj

a    0.0
b    1.0
c    2.0
d    3.0
dtype: float64

In [35]:
obj['b']

1.0

In [36]:
obj[1]

C:\Users\HP\AppData\Local\Temp\ipykernel_3628\2469632899.py:1: FutureWarning: Series.__getitem__ treating keys as positions is deprecated. In a future version, integer keys will always be treated as labels (consistent with DataFrame behavior). To access a value by position, use `ser.iloc[pos]`
  obj[1]

1.0

In [37]:
obj[2:4]

c    2.0
d    3.0
dtype: float64

In [38]:
obj[['b','a','d']]

b    1.0
a    0.0
d    3.0
dtype: float64

In [39]:
obj[[1,3]]

C:\Users\HP\AppData\Local\Temp\ipykernel_3628\1781339481.py:1: FutureWarning: Series.__getitem__ treating keys as positions is deprecated. In a future version, integer keys will always be treated as labels (consistent with DataFrame behavior). To access a value by position, use `ser.iloc[pos]`
  obj[[1,3]]

b    1.0
d    3.0
dtype: float64

In [40]:
obj[obj<2]

a    0.0
b    1.0
dtype: float64

In [41]:
# preferred way is to select using the loc operator

obj.loc[['b','a','d']]

b    1.0
a    0.0
d    3.0
dtype: float64

The reason for preferring loc operator is because of the different treatment of integers while indexing with []. Regular []-based indexing will treat integers as labels if the index contains integers, so the behaviour differs depending on the data type of the index.

In [42]:
obj1 = pd.Series([1,2,3],index = [2,0,1])

In [43]:
obj2 = pd.Series([1,2,3],index=['a','b','c'])

In [44]:
obj1

2    1
0    2
1    3
dtype: int64

In [45]:
obj2

a    1
b    2
c    3
dtype: int64

In [46]:
obj1[[0,1,2]]

0    2
1    3
2    1
dtype: int64

In [47]:
obj2[[0,1,2]]

C:\Users\HP\AppData\Local\Temp\ipykernel_3628\2179584337.py:1: FutureWarning: Series.__getitem__ treating keys as positions is deprecated. In a future version, integer keys will always be treated as labels (consistent with DataFrame behavior). To access a value by position, use `ser.iloc[pos]`
  obj2[[0,1,2]]

a    1
b    2
c    3
dtype: int64

In [48]:
obj1.loc[[0,1,2]]

0    2
1    3
2    1
dtype: int64

iloc -- operator that indexes exclusively with integers to work consistently whether the index contains integers or not

In [49]:
obj1.iloc[[0,1,2]]

2    1
0    2
1    3
dtype: int64

In [50]:
obj2.iloc[[0,1,2]]

a    1
b    2
c    3
dtype: int64

In [51]:
obj.loc['b':'c'] # endpoint is inclusive works differently here

b    1.0
c    2.0
dtype: float64

In [52]:
obj.loc['b':'c'] = 5

In [53]:
obj

a    0.0
b    5.0
c    5.0
d    3.0
dtype: float64

Indexing into a DataFrame is for retreiving one or more columns either with a single value or sequence

In [54]:
data = pd.DataFrame(np.arange(16).reshape((4,4)),index=['Ohio','Colorado','Utah','New York'],columns=['one','two','three','four'])

In [55]:
data

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [56]:
data['two']

Ohio         1
Colorado     5
Utah         9
New York    13
Name: two, dtype: int32

In [57]:
data[['three','four']]

          three  four
Ohio          2     3
Colorado      6     7
Utah         10    11
New York     14    15

In [58]:
data[:2] # special case first slicing.

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7

In [59]:
# or selecting with a boolean array
data[data['three']>6]

          one  two  three  four
Utah        8    9     10    11
New York   12   13     14    15

In [60]:
data[3:]

          one  two  three  four
New York   12   13     14    15

In [61]:
data[1:]

          one  two  three  four
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [62]:
data<5

            one    two  three   four
Ohio       True   True   True   True
Colorado   True  False  False  False
Utah      False  False  False  False
New York  False  False  False  False

In [63]:
data[data<5] = 0

In [64]:
data

          one  two  three  four
Ohio        0    0      0     0
Colorado    0    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

#### Selection on DataFrame using loc and iloc

In [65]:
# special operators for label based and integer based indexing
data.loc['Colorado',['two','three']]

two      5
three    6
Name: Colorado, dtype: int32

In [66]:
data.iloc[2,[3,0,1]]

four    11
one      8
two      9
Name: Utah, dtype: int32

In [67]:
data.iloc[2]

one       8
two       9
three    10
four     11
Name: Utah, dtype: int32

In [68]:
# Both indexing works with slicing 
data.loc[:'Utah','two']

Ohio        0
Colorado    5
Utah        9
Name: two, dtype: int32

In [69]:
data.loc['Colorado':]

          one  two  three  four
Colorado    0    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [70]:
data.loc[:,['two','three']]

          two  three
Ohio        0      0
Colorado    5      6
Utah        9     10
New York   13     14

In [71]:
data.iloc[:,3]

Ohio         0
Colorado     7
Utah        11
New York    15
Name: four, dtype: int32

In [72]:
data.iloc[2,3]

11

#### Integer Indexing Pitfalls

Working with pandas indexed with integers has some differences with indexing as compared to built in Python Data Structures like list and tuples

In [73]:
ser = pd.Series(np.arange(3.))

In [74]:
ser

0    0.0
1    1.0
2    2.0
dtype: float64

Here ser[-1] will throw an error because since it is indexed by integer it will be misleading, there it is recommended to iloc or loc that will always give you what you want.

On the other hand, if it is not indexed with integer, it would not give error let's see the example.

In [75]:
ser2 = pd.Series(np.arange(3.),index=['a','b','c'])

In [76]:
ser2[-1]

C:\Users\HP\AppData\Local\Temp\ipykernel_3628\811950851.py:1: FutureWarning: Series.__getitem__ treating keys as positions is deprecated. In a future version, integer keys will always be treated as labels (consistent with DataFrame behavior). To access a value by position, use `ser.iloc[pos]`
  ser2[-1]

2.0

In [77]:
ser.iloc[-1]

2.0

In [78]:
ser2.iloc[-1]

2.0

In [79]:
# slicing with integers is always integer oriented.
ser[:2]

0    0.0
1    1.0
dtype: float64

#### Arithmetic and Data Alignment

When you adding two pd objects together, if any index pairs is not the same, the result will be union of the index pairs

In [80]:
s1 = pd.Series([7.3, -2.5, 3.4, 1.5], index=['a', 'c', 'd', 'e'])

In [81]:
s2 = pd.Series([-2.1, 3.6, -1.5, 4, 3.1], index=['a', 'c', 'e', 'f', 'g'])

In [82]:
s1

a    7.3
c   -2.5
d    3.4
e    1.5
dtype: float64

In [83]:
s2

a   -2.1
c    3.6
e   -1.5
f    4.0
g    3.1
dtype: float64

In [84]:
s1+s2

a    5.2
c    1.1
d    NaN
e    0.0
f    NaN
g    NaN
dtype: float64

The internal data alignment introduces missing values in the locations where labels don't match.

In [85]:
df1 = pd.DataFrame(np.arange(9).reshape((3,3)),index=['Ohio','Texas','Utah'],columns=list('bcd'))

In [86]:
df2 = pd.DataFrame(np.arange(12).reshape((4,3)),index=['Colorado','Ohio','Oregon','Texas'],columns=list('bde'))

In [87]:
df1

       b  c  d
Ohio   0  1  2
Texas  3  4  5
Utah   6  7  8

In [88]:
df2

          b   d   e
Colorado  0   1   2
Ohio      3   4   5
Oregon    6   7   8
Texas     9  10  11

In [89]:
df1+df2

             b   c     d   e
Colorado   NaN NaN   NaN NaN
Ohio       3.0 NaN   6.0 NaN
Oregon     NaN NaN   NaN NaN
Texas     12.0 NaN  15.0 NaN
Utah       NaN NaN   NaN NaN

If you add Dataframe objects with no columns or row labels in common, the result will contain all null values.

In [90]:
df1= pd.DataFrame({'A':[1,2]})

In [91]:
df2 = pd.DataFrame({'B':[3,4]})

In [92]:
df1

   A
0  1
1  2

In [93]:
df2

   B
0  3
1  4

In [94]:
df1+df2

    A   B
0 NaN NaN
1 NaN NaN